brew "git"
brew "gh"
brew "ghq"

brew "bat"
brew "ripgrep"
brew "eza"
brew "fzf"
brew "jq"

brew "neovim"
brew "starship"

brew "pnpm"

# brew "curl"
# brew "grep"
# brew "tree"

# GNU tools
brew "binutils"
brew "coreutils"
brew "diffutils"
brew "findutils"
brew "moreutils"
brew "gawk"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-time"
brew "gzip"
brew "wget"

brew "rsync"
brew "zip"

# utility
brew "tig"
brew "bottom"

# zsh
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# fonts
cask "font-plemol-jp"
cask "font-plemol-jp-hs"
cask "font-plemol-jp-nf"

# Others
cask "alacritty"
cask "firefox"

cask "visual-studio-code"
cask "orbstack"

cask "raycast"
cask "xquartz"
